zhanzr/LPC54114-Board/sdmmc/sdmmc_2.1.1/src/fsl_mmc.c
static status_t MMC_SendExtendedCsd(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    sdhc_command_t command = {0};
    sdhc_transfer_t content = {0};
    sdhc_data_t data = {0};
    uint32_t i;

    command.index = kMMC_SendExtendedCsd;
    command.argument = 0U;
    command.responseType = kSDHC_ResponseTypeR1;

    data.blockCount = 1U;
    data.blockSize = MMC_EXTENDED_CSD_BYTES;
    data.rxData = card->rawExtendedCsd;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success == card->host.transfer(card->host.base, &content)) &&
        (!(command.response[0U] & kSDMMC_R1ErrorAllFlag)))
    {
        /* The response is from bit 127:8 in R2, corresponding to command.response[3][31:0] to
        command.response[0U][31:8] */
        for (i = 0U; i < MMC_EXTENDED_CSD_BYTES / 4U; i++)
        {
            switch (card->host.config.endianMode)
            {
                case kSDHC_EndianModeLittle:
                    /* Doesn't need to switch byte sequence when decode bytes as little endian sequence. */
                    break;
                case kSDHC_EndianModeBig:
                    /* In big endian mode, the SD bus byte transferred first is the byte stored in highest position
                    in a word which cause 4 byte's sequence in a word is not consistent with their original sequence
                    from card. */
                    card->rawExtendedCsd[i] = SWAP_WORD_BYTE_SEQUENCE(card->rawExtendedCsd[i]);
                    break;
                case kSDHC_EndianModeHalfWordBig:
                    card->rawExtendedCsd[i] = SWAP_HALF_WROD_BYTE_SEQUENCE(card->rawExtendedCsd[i]);
                    break;
                default:
                    return kStatus_SDMMC_NotSupportYet;
            }
        }
        MMC_DecodeExtendedCsd(card, card->rawExtendedCsd);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static uint8_t MMC_GetPowerClass(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    uint8_t mask = 0;
    uint8_t powerClass = 0;

    switch (width)
    {
        case kMMC_DataBusWidth4bit:
            mask = MMC_POWER_CLASS_4BIT_MASK; /* The mask of 4 bit bus width's power class */
            break;
        case kMMC_DataBusWidth8bit:
            mask = MMC_POWER_CLASS_8BIT_MASK; /* The mask of 8 bit bus width's power class */
            break;
        case kMMC_DataBusWidth1bit:
        default:
            break;
    }

    switch (card->hostVoltageWindow)
    {
        case kMMC_VoltageWindow170to195:
            if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
            {
                powerClass = ((card->extendedCsd.powerClass52MHz195V) & mask);
            }
            else if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
            {
                powerClass = ((card->extendedCsd.powerClass26MHz195V) & mask);
            }
            else
            {
            }
            break;
        case kMMC_VoltageWindows270to360:
            if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
            {
                powerClass = ((card->extendedCsd.powerClass52MHz360V) & mask);
            }
            else if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
            {
                powerClass = ((card->extendedCsd.powerClass26MHz360V) & mask);
            }
            else
            {
            }
            break;
        default:
            powerClass = 0;
            break;
    }

    return powerClass;
}

static status_t MMC_SendTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card);
    assert(card->host.transfer);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern);

    sdhc_transfer_t content = {0};
    sdhc_command_t command = {0};
    sdhc_data_t data = {0};

    command.index = kSDMMC_SendTuningBlock;
    command.argument = 0U;
    command.responseType = kSDHC_ResponseTypeR1;

    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount = 1U;
    data.blockSize = blockSize;
    data.txData = pattern;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success != card->host.transfer(card->host.base, &content)) ||
        (command.response[0U] & kSDMMC_R1ErrorAllFlag))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_ReceiveTestPattern(mmc_card_t *card, uint32_t blockSize, uint32_t *pattern)
{
    assert(card);
    assert(card->host.transfer);
    assert(blockSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE);
    assert(pattern);

    sdhc_transfer_t content = {0};
    sdhc_command_t command = {0};
    sdhc_data_t data = {0};

    command.index = kMMC_BusTestRead;
    command.responseType = kSDHC_ResponseTypeR1;

    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount = 1U;
    data.blockSize = blockSize;
    data.rxData = pattern;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success != card->host.transfer(card->host.base, &content)) ||
        ((command.response[0U]) & kSDMMC_R1ErrorAllFlag))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_TestDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    uint32_t blockSize;
    uint32_t sendPattern[2U] = {0};
    uint32_t receivedPattern[2U] = {0};
    uint32_t xorMask;
    uint32_t xorResult;

    /* For 8 data lines the data block would be (MSB to LSB): 0x0000_0000_0000_AA55,
    For 4 data lines the data block would be (MSB to LSB): 0x0000_005A,
    For only 1 data line the data block would be: 0x80 */
    switch (width)
    {
        case kMMC_DataBusWidth8bit:
            blockSize = 8U;
            sendPattern[0U] = 0xAA55U;
            xorMask = 0xFFFFU;
            xorResult = 0xFFFFU;
            break;
        case kMMC_DataBusWidth4bit:
            blockSize = 4U;
            sendPattern[0U] = 0x5AU;
            xorMask = 0xFFU;
            xorResult = 0xFFU;
            break;
        default:
            blockSize = 4U;
            sendPattern[0U] = 0x80U;
            xorMask = 0xFFU;
            xorResult = 0xC0U;
            break;
    }
    switch (card->host.config.endianMode)
    {
        case kSDHC_EndianModeLittle:
            /* Doesn't need to switch byte sequence when decodes bytes as little endian sequence. */
            break;
        case kSDHC_EndianModeBig:
            /* In big endian mode, the byte transferred first is the byte stored in highest byte position in a word
            which will cause the card receive the inverted byte sequence in a word in bus test procedure. So the
            sequence of 4 bytes stored in a word should be converted. */
            sendPattern[0] = SWAP_WORD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_WORD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_WORD_BYTE_SEQUENCE(xorResult);
            break;
        case kSDHC_EndianModeHalfWordBig:
            /* In half word big endian mode, the byte transferred first is the lower byte in the higher half word.
            0xAA55U should be converted to 0xAA550000U to set the 0x55 to be the first byte to transfer. */
            sendPattern[0] = SWAP_HALF_WROD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_HALF_WROD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_HALF_WROD_BYTE_SEQUENCE(xorResult);
            sendPattern[0] = SWAP_WORD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_WORD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_WORD_BYTE_SEQUENCE(xorResult);
            break;
        default:
            return kStatus_SDMMC_NotSupportYet;
    }

    if (kStatus_Success != MMC_SendTestPattern(card, blockSize, sendPattern))
    {
        return kStatus_SDMMC_SendTestPatternFailed;
    }
    if (kStatus_Success != MMC_ReceiveTestPattern(card, blockSize, receivedPattern))
    {
        return kStatus_SDMMC_ReceiveTestPatternFailed;
    }

